#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.project.google_project.project will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "012F92-9ADBCB-CBCB9F"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "go-api-gke"
      + number              = (known after apply)
      + org_id              = "937017791987"
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project.google_project_service.project[0] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project.google_project_service.project[1] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudbilling.googleapis.com"
    }

  # module.project.google_project_service.project[2] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.project.google_project_service.project[3] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "container.googleapis.com"
    }

  # module.project.google_project_service.project[4] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "containeranalysis.googleapis.com"
    }

  # module.project.google_project_service.project[5] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "containerregistry.googleapis.com"
    }

  # module.project.google_project_service.project[6] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "containerscanning.googleapis.com"
    }

  # module.project.random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + prefix      = "go-api-gke-"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `GCP Terraform fmt + validate + plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./gcp`*
